---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ImportScaleTooLarge
source: html/78a38c0a-85c8-5592-1a3d-929f949aeebd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ImportScaleTooLarge Property

This scale factor would make the imported object too large. Reverting to the previous scale factor.

## Syntax (C#)
```csharp
public static FailureDefinitionId ImportScaleTooLarge { get; }
```